mermaid diagrams updated
